[
    {
        "title": "Software Engineer (Golang / Python) в Evolved Ideas, $4000–6500, віддалено",
        "link": "https://jobs.dou.ua/companies/evolved-ideas/vacancies/267155/?utm_source=jobsrss",
        "description": "<p>Amazing work happens when everyone enjoys the journey. This is why we and our partner Momox — Europe’s leading online buying-and-selling service for books, CDs, movies, games, and fashion do everything to set you up for success. <br>We know that your ideas grow best in a challenging environment where a team of passionate professionals from diverse backgrounds come together to think outside the box<br><br>We are looking for <strong>Software Engineer (Golang / Python)</strong> to join the <strong>Evolved Ideas</strong> team.</p><h3>YOUR MISSION</h3><ul><li>Responsibility for the maintenance and further development of the product search for our internal platforms momox-fashion and medimops with Apache, Solr, Python / Golang </li><li>Cooperate closely with the product teams</li><li>Advise our product owners and development teams on the optimization and further development of the search and its integration into our existing products</li><li>Developing a personalized and intelligent search and recommendation system with our ML/AI team</li></ul><h3>YOUR PROFILE</h3><ul><li>Experience in Golang and/or Python</li><li>Experience with Apache Solr and/or ElasticSearch</li><li>Good knowledge of Kubernetes and Docker</li><li>Passionate about search &amp; machine learning technologies</li><li>Familiarity with information retrieval, ranking systems, recommendation systems</li><li>Familiarity with Google Cloud or other cloud technologies</li><li>Clear communication, tolerant and team-oriented</li><li>Eager to learn and motivated to hands-on contributing</li><li>Intermediate level of English</li></ul><h3>YOU CAN LOOK FORWARD TO</h3><ul><li>One day of a <nobr>14-day</nobr> sprint is yours! Personal development, your own projects or learning new technologies — it’s up to you!</li><li>Work in an agile environment (Scrum) with flat hierarchies</li><li>We support you in creating open source projects</li><li>Grow with space and budget for your professional development</li><li>Enjoy a good work-life-balance with flexible working hours</li><li>Healthcare insurance</li></ul><h3><strong>ABOUT US</strong></h3><p>Evolved Ideas is a technology service provider located in Ukraine and is a sister company of Evolve IT Consulting, a multi-award-winning tech consultancy based in Leicester, UK.</p><p>Founded in 2007 as a pure business management consultancy, Evolve has transformed into a full-fledged software house specialising in building client-managed Extended Teams, and offering bespoke software solutions to both startups and established brands.</p><p>Our values are Listen, Transform and Enrich and we are driven by delivering true value for our clients through technological innovation.</p><p>We are an energetic and dynamic agile company with unparalleled tech leadership team having more than 50 years of cumulative experience building and delivering own and custom state-of-the-art and meaningful software solutions.</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/evolved-ideas/vacancies/267155/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 10 Jun 2024 17:32:54 +0300",
        "guid": "https://jobs.dou.ua/companies/evolved-ideas/vacancies/267155/?1718029974"
    },
    {
        "title": "Golang Developer (Senior) в Ixilix, віддалено",
        "link": "https://jobs.dou.ua/companies/ixilix/vacancies/264993/?utm_source=jobsrss",
        "description": "<p>An international product company specializing in gaming products is looking for a Senior Golang Developer.<br><br><strong>About project:</strong> <br>— The project is a gaming solution that consists of multiple components such as frontend, backend, and other services.<br>The team you will join works on the backend side. It is a high-load set of services that processes game logic and works with a database along with communicating with other service.<br><br><strong>Your future team:</strong> <br>— PM, Python Team, QA Team, AQA Team, Frontend Team.<br><br><strong>The following skills are important to us:</strong></p><ul><li>Practical experience in development with Golang — from 3+ years;</li><li>Practical experience in development with Python — from 2+ years;</li><li>Experience with SQL Databases (MariaDB, Postgresql);</li><li>Strong knowledge in SQL as plus;</li><li>Experience with Clickhouse, </li><li>Knowledge of containerized application development and experience with Docker, Docker Compose, Kubernetes, AWS;</li><li>Experience with Redis, RabbitMQ, Nats;</li><li>Solid knowledge of microservice architecture;</li><li>Knowledge in What is SAGA pattern is, understanding difference between orchestration and choreography</li><li>Experience in the development of scalable systems of massive transaction processing;</li><li>Experience developing unit tests;</li><li>Experience working with message queues, task queues;</li><li>Level of knowledge of English (technical) — at least B1.</li></ul><p><strong>The following skills are desirable:</strong></p><ul><li>Knowledge in theory of category;</li><li>Knowledge in func style programming;</li><li>Understanding clean patterns like lambda calculus, monads, composing, map, reduce.</li></ul><p><strong>Your future</strong> <strong>responsibilities:</strong></p><ul><li>Develop service components for a scalable platform ensuring quality;</li><li>Design and implement data models and APIs;</li><li>Collaborate with the DevOps team to ensure smooth deployment and integration;</li><li>Write clean, efficient and reusable code &amp; unit tests in Golang and Python following coding standards and best practices.</li></ul><p><strong>What we offer:</strong></p><p>— <strong>Competitive salary and Quarterly bonus system.</strong></p><p><strong>— Flexible schedule</strong> — You can choose convenient working hours (start work from 8 to 11, 8 hours/day) — Remote — No tracking systems.</p><p>— <strong>Care for employees’ work-life balance </strong>— 17 working days of vacation; unlimited sick leave; preserved public holidays, in accordance with Ukrainian legislation.<br><br>— <strong>Learning and professional development </strong>— Expert communities, paid professional courses and certifications, professional events.<br><br></p><p>We value honesty, openness, friendliness, a positive attitude, and independence.</p><p>Let’s create a cool product with us:)</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/ixilix/vacancies/264993/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 10 Jun 2024 13:38:15 +0300",
        "guid": "https://jobs.dou.ua/companies/ixilix/vacancies/264993/?1718015895"
    },
    {
        "title": "Senior FullStack Engineer в Code Space, віддалено",
        "link": "https://jobs.dou.ua/companies/codespace/vacancies/267176/?utm_source=jobsrss",
        "description": "<p>Our client, an international product company is looking for a Senior FullStack Engineer to help them develop their product.<br><br>The company builds technologies that are rooted in healthy conversations, transparent first-party data relationships, and mutual economic prosperity for all stakeholders. Wherever there is a content creator to empower, a conversation to protect, or a community to host — they will be there.<br><br>Today, they partner with more than 1,000 top-tier publishers (including Wall Street Journal, New York Times, News Corp, Verizon Media, CBS, Fox News, Hearst, Refinery 29, and more) and host 100 million monthly active users.<br><br>They are empowering individuals to take action and demand more from one another. Crafting technology that naturally brings people together and fosters healthy discussion—so they have more dinner-table talks and less shouting matches online.<br><br></p><h3><strong>What You’ll Do:</strong></h3><ul><li><strong>Drive Innovation</strong>: Design, develop, and deploy pivotal features from concept through to production, impacting our core products significantly.</li><li><strong>Elevate Technical Excellence</strong>: Enhance the technical prowess of your team and cross-functional engineers.</li><li><strong>Lead Strategically</strong>: Manage high-priority projects to create scalable, fast-to-market products.</li><li><strong>Collaborate Effectively</strong>: Work closely with a dynamic new team of engineers, designers, analysts, and product specialists to push the boundaries of innovation.</li></ul><p><strong>Technical Stack:</strong> Golang, Typescript, Next.JS, AWS, Kubernetes, Postgres, ElasticSearch, Redis</p><h3><strong>The Skills and Experience You Bring:</strong></h3><ul><li>Strong proven technical skills and a passion for developing products that people love and use every day.</li><li>6 years of previous experience building a web application.</li><li>2 years of previous experience in Full-stack development.</li><li>Understanding of products and a passion for building software that provides a great experience.</li><li>Track record of excellence.</li><li>Team player, strong communication skills, and empathetic.</li><li>Focus on quality and simplicity.</li></ul>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/codespace/vacancies/267176/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 10 Jun 2024 10:02:07 +0300",
        "guid": "https://jobs.dou.ua/companies/codespace/vacancies/267176/?1718002927"
    },
    {
        "title": "Senior Golang/Go Engineer в [Coreteka], віддалено",
        "link": "https://jobs.dou.ua/companies/coreteka-com/vacancies/270311/?utm_source=jobsrss",
        "description": "<p>Компанія <strong>CoreTeka</strong> формує R&amp;D офіс для великої американської продуктової компанії, яка вірить у перемогу України та хоче розвивати свій продукт з найкращими інженерами нашої країни.</p><p><b>Проєкт</b> — великий сервіс з автоматизації продажів.</p><p>Ви отримаєте можливість працювати з розробниками та менеджерами високого рівня із США. Вам пропонується гнучкий графік, який ви можете підлаштувати під свої потреби, обов’язковим для відвідування є тільки <strong>дейлі мітинг в вечірній час.</strong> <br><br><b>Ключові факти про проєкт:</b> <br>— Компанія заснована в 2014 році і на даний момент залучила $489 млн. інвестицій, за загальної капіталізації компанії в $4,4 млрд.<br>— Ключова технічна команда розробників — це ТОП-розробники з Facebook, Microsoft, Amazon.<br>— У 2022 році компанія потрапила до рейтингу America’s Best Startup Employers (<a href=\"http://forbes.com/\" target=\"_blank\">forbes.com</a>).<br>— У 2021 році компанія потрапила до рейтингу LinkedIn Top Startups 2021.<br>— У 2021 році компанія потрапила до рейтингу Technology Fast 500 winners.<br>— Клієнтами продукту є такі великі компанії як MongoDB, Zoom, Twilio, DocuSign, Siemens.</p><p><b>Ключові вимоги:</b></p><ul><li><strong>6+ років досвіду</strong> у бекенд розробці.</li><li>1+ року досвіду роботи з Golang.</li><li>Ступінь бакалавра або магістра з комп’ютерних наук, програмної інженерії або суміжної галузі.</li><li>Впевнений досвід у розробці складних систем, від дизайну до реалізації.</li><li>Експертиза в архітектурі програмного забезпечення та шаблонах проектування.</li><li>Гарні навички вирішення проблем і здатність мислити критично й аналітично.</li><li>Відмінні навички спілкування та роботи в команді.</li><li>Досвід роботи з Agile методологіями розробки є перевагою.</li><li>Знання сучасних технологій розробки програмного забезпечення.</li><li>Рівень англійської від <strong>Upper-Intermediate</strong> (для щоденного спілкування).</li></ul><p><b>Основні задачі:</b></p><ul><li>Проектування, розробка, тестування та підтримка програмних додатків і систем. Забезпечення високої якості, ефективності і масштабованості.</li><li>Самостійність та відповідальність, сприяння розвитку інновацій та вдосконалення.</li><li>Сприяння розробці архітектури, прийняття обґрунтованих рішень для оптимізації продуктивності та зручності обслуговування.</li><li>Виявлення та вирішення технічних проблем, активна робота над пошуком інноваційних рішень.</li><li>Участь у перевірці коду, підтримка стандартів кодування, вдосконалення та гарантія якості коду.</li><li>Створення та ведення чіткої технічної документації.</li></ul><p><b>Про команду та проєкт:</b></p><p>Ми шукаємо талановитого та досвідченого Staff Software Engineer, який допоможе розширити концептуальне бачення компанії. Команда синхронізації («Synk») відповідає за платформу, що забезпечує двонаправлену інтеграцію даних між продуктом, API та endpoints (наприклад, Salesforce, Microsoft Dynamics). Користувачі можуть використовувати дані нашої платформи у будь-якому іншому додатку.</p><p>Як Staff Software Engineer, ви відіграватимете ключову роль у наших зусиллях з розробки програмного забезпечення, роблячи внесок у проектування, впровадження та підтримку високопродуктивних програмних рішень. Ви тісно співпрацюватимете з міжфункціональними командами, щоб визначити технічні вимоги та стимулювати розробку інноваційних, масштабованих та надійних систем.</p><p><b>Ми пропонуємо:</b></p><p>— Можливість працювати з розробниками та менеджерами високого рівня із США.<br>— Гнучкий графік.<br>— Paid leaves.<br>— Медичне страхування.<br>— Плановий перегляд розміру компенсації.<br>— Вихідні дні відповідно до державних свят України.<br>— Інтерактивне залучення до побудови та оптимізації процесів розробки.<br>— Професійний розвиток.<br>— Довгострокову співпрацю.</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/coreteka-com/vacancies/270311/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 10 Jun 2024 09:59:13 +0300",
        "guid": "https://jobs.dou.ua/companies/coreteka-com/vacancies/270311/?1718002753"
    },
    {
        "title": "Middle Go Developer в TechMagic, Київ, Львів, за кордоном",
        "link": "https://jobs.dou.ua/companies/techmagic/vacancies/264363/?utm_source=jobsrss",
        "description": "<p>We’re looking for a Middle Go developer with 2+ years of professional experience to join our client — an innovative rent platform from the USA.</p><h3><strong>Must have</strong></h3><ul><li>2+ years of experience in Golang development</li><li>Familiarity with JavaScript</li><li>Competency with building complex CRM systems</li><li>Expert at the customer user interface</li><li>At least an Upper-Intermediate level of English</li></ul><h3><strong>Will be a plus</strong></h3><ul><li>Experience with GCP Cloud will be a great plus</li></ul><h3><strong>Customer</strong></h3><p>This is a startup from the United States</p><h3><strong>Product</strong></h3><p>The product is revolutionizing the residential rental market by streamlining the leasing process with cutting-edge FinTech solutions. The platform brings unparalleled efficiency and personalization to renting, transforming how property owners and renters connect. This is a way to empower both property owners and renters with transparency, efficiency, and the tools needed for a smoother rental experience. The mission is to modernize the rental ecosystem, making it more accessible, equitable, and user-friendly for everyone involved.</p><h3><strong>Interview Stages</strong></h3><p>1. Call with Recruiter</p><p>2. Interview with Go Engineer</p><p>3. Client interview</p><h3><strong>Our Benefits</strong></h3><ul><li>Opportunity to work with international clients;</li><li>Work from anywhere (fully remotely in Poland)</li><li>Paid vacations and sick-leaves, additional days-off, relocation bonus;</li><li>Education: regular tech-talks, educational courses, paid certifications, English classes;</li><li>One of the best IT employers in Lviv based on DOU rating.</li></ul>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/techmagic/vacancies/264363/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Fri, 07 Jun 2024 17:54:50 +0300",
        "guid": "https://jobs.dou.ua/companies/techmagic/vacancies/264363/?1717772090"
    },
    {
        "title": "Senior Full Stack Golang developer в HIRETOP, $4500–5400, віддалено",
        "link": "https://jobs.dou.ua/companies/hiretop/vacancies/270207/?utm_source=jobsrss",
        "description": "<p>A dynamic startup company in the Netherlands is seeking a passionate and talented FullStack Developer to join their mission-driven team. The goal is to accelerate the adoption of clean energy, and they’re looking for someone who wants to make a significant impact on the energy transition.</p>\n\n<p>About the project:</p><p>It is a small team of experts dedicated to rapidly iterating and advancing the state of technology in electric vehicle charging and home energy management. The mission is to create innovative services and technology that surpass current market offerings.</p>\n\n<p>Role Overview:</p><p>As a FullStack Developer, your work will directly contribute to the energy transition. You’ll have the unique opportunity to work in a greenfield environment, shaping the future and leaving a lasting legacy. Together, you will build a highly scalable microservices-based platform capable of connecting millions of IoT devices. </p>\n\n<p>Key Responsibilities:</p><ul><li>Develop and maintain backend systems using Golang and frontend interfaces with React.</li><li>Utilize your experience in creating and maintaining APIs.</li><li>Leverage Kubernetes for container orchestration.</li><li>Work with databases such as MongoDB and VictoriaDB.</li><li>Contribute to CI/CD processes and strategies.</li><li>Apply your knowledge of IoT to enhance our platform’s capabilities.</li><li>Collaborate closely with the team in English.</li></ul>\n\n<p>Qualifications:</p><ul><li>Minimum of 6 years of development experience, preferably in the EV/Energy or IoT domain.</li><li>Proficiency in Golang for backend development (Must) and React for frontend development.</li><li>Experience with React Native is a plus.</li><li>Hands-on experience with Kubernetes is highly preferred.</li><li>Familiarity with MongoDB and VictoriaDB.</li><li>Strong understanding of CI/CD practices.</li><li>IoT experience is an advantage.</li><li>Independent, creative, and highly motivated mindset.</li><li>B2 level of English proficiency required</li></ul><p>Why Join Us:</p><p>This is the perfect opportunity for a developer who thrives on creating products from scratch. If you’re looking to be a part of a groundbreaking project and contribute to a sustainable future, we’d love to hear from you.</p>\n\n<p>How to Apply:</p><p>Please send your CV via email at <a href=\"mailto:ksenia.e@hiretop.com\">ksenia.e@hiretop.com</a>, contact on Telegram @riueoa, or call +380961044746.</p><p>Join and make a difference in the world of clean energy!</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/hiretop/vacancies/270207/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Fri, 07 Jun 2024 13:37:59 +0300",
        "guid": "https://jobs.dou.ua/companies/hiretop/vacancies/270207/?1717756679"
    },
    {
        "title": "Golang Software Developer в SWEET.TV, $2500–3500, за кордоном, віддалено",
        "link": "https://jobs.dou.ua/companies/trinity-1/vacancies/93842/?utm_source=jobsrss",
        "description": "<h3>Необхідні навички</h3>\n<p>3+ years of Golang experience.<br>Understanding twelve-factor app, cleancode patterns.<br>Good understanding of SQL/NoSQL (PostgreSQL preferred).<br>Good understanding of RESTful API design and microservice architecture.<br>Understanding of unit testing concept and code quality.<br>Experience with Websockets.<br>Git.<br>Experience with Docker and Docker Compose.</p>\n\n\n    <h3>Пропонуємо</h3>\n    <p>Career and professional development opportunities.<br>Relocation package.<br>Regular performance evaluation and salary revision.<br>Flexible working hours.<br>Remote work opportunities.<br>Certifications and courses financed or co-financed by the company.<br>20 working days of paid vacation per business year and 11 paid Ukrainian official holidays.<br>10 paid sick leaves.<br>The internal mentorship program, corporate training, and events.<br>Great team parties, company events, and branded presents.<br>Company legal and accounting support.<br>Comfortable office, equipped with everything you need and round-the-clock access.</p>\n\n    <h3>Обов’язки</h3>\n    <p>Development and implementation of microservice architecture.<br>Work very closely with the current team and the founders of the company.<br>Participate in all aspects of the application development: from feature definition and estimation to architecture, implementation, testing, deployment, measurement, and refinement.<br>Implementing new features, bug fixing</p>\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/trinity-1/vacancies/93842/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Thu, 06 Jun 2024 17:50:27 +0300",
        "guid": "https://jobs.dou.ua/companies/trinity-1/vacancies/93842/?1717685427"
    },
    {
        "title": "Senior Golang Developer в 4IRE, віддалено",
        "link": "https://jobs.dou.ua/companies/4ire-labs/vacancies/270025/?utm_source=jobsrss",
        "description": "<p><b>Requirements:</b></p><ul><li>Proven backend development experience of 5 years and good knowledge of Golang;</li><li>Familiarity with industry-standard tools for source control and containerization, including Git/Github and Docker;</li><li>Strong communication skills in English, with the ability to effectively convey complex technical concepts to both technical and non-technical stakeholders;</li><li> Proactive attitude, with the ability to work independently and report directly to the customer when necessary.</li></ul><p><br><b>Nice to have:</b></p><ul><li>Deep understanding of blockchain technologies.</li></ul><p><b>Responsibilities:</b></p><ul><li>Participation in the development of architecture and design of the project;</li><li>Write clean, efficient, and maintainable code in Golang;</li><li> Utilize industry-standard tools such as Git/Github and Docker for version control and containerization;</li><li>Conduct code reviews, identify areas for improvement, and implement best practices to ensure high-quality software development.</li></ul><p><b>We offer:</b></p><ul><li>100% remote;</li><li>Competitive compensation is linked to the USD rate.</li><li>Flexible working hours in the European time zone.</li><li>The team is always ready to help.</li><li>Opportunities for professional and personal growth.</li><li>Paid vacation and sick leaves.</li></ul>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/4ire-labs/vacancies/270025/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Thu, 06 Jun 2024 10:28:56 +0300",
        "guid": "https://jobs.dou.ua/companies/4ire-labs/vacancies/270025/?1717658936"
    },
    {
        "title": "Back-end Engineer (PHP switch to Golang) в SKELAR, Київ",
        "link": "https://jobs.dou.ua/companies/skelar/vacancies/269982/?utm_source=jobsrss",
        "description": "<p><strong>SKELAR</strong> — це venture builder, який будує міжнародні продуктові IT-компанії за правилами світу венчурних інвестицій. Разом із ко-фаундерами збираємо сильні команди, щоб запускати продуктові IT-бізнеси та перемагати на глобальних ринках. </p><p>Зараз ми в пошуку <strong>Back-end Engineer.</strong></p><p><strong>Howly</strong> — маркетплейс професійних онлайн-консультацій. Ми плануємо зробити революцію у галузі онлайн-консультацій та стати персональним кишеньковим експертом. Howly надає швидкі, персоналізовані та доступні відповіді на питання користувачів, а для експертів — створює можливість ефективно застосовувати свої знання, досвід та час.</p><p><strong>Cтек технологій: </strong> <a href=\"https://skelar-tech.github.io/Howly/\" target=\"_blank\">skelar-tech.github.io/Howly</a></p><p><strong>Які виклики чекають:</strong> <br>— продумувати реалізацію продуктових вимог та втілювати їх у життя;<br>— покривати свій код тестами та забезпечувати якість функціоналу;<br>— деплоїти свій код на production та допомагати моніторити роботу системи;<br>— закривати технічні задачі разом з тех. лідом.</p><p> <strong>Що для нас важливо:</strong> <br>комерційний досвід з:<br>— PHP 8.1;<br>— Symfony;<br>— ООП (базові принципи, SOLID, GoF patterns, Clean code);<br>— Реляційною СУБД (PostgreSQL, MySQL, etc.);<br>— Чергами (Kafka, RabbitMQ, etc.);<br>— Написанням тестів (unit, integration);<br>— Мікросервісною архітектурою;<br>— Docker.<br><br><strong>Буде перевагою:</strong> <br>— Вміння аналізувати логи, користуватись системами моніторингу;<br>— Досвід роботи з gRPC або Apache Thrift;<br>— Досвід з практиками: Test-driven Development (TDD), Behavior-driven development (BDD);<br>— Розуміння, а ще краще практичний досвід з Domain-driven Design (DDD);<br>— Розуміння як працює Kubernetes;<br>— Розуміння як працює CI/CD.</p>\n\n<p>Окрім бізнесів, ми маємо <strong>Благодійний фонд SKELAR</strong>, який допомагає із забезпеченням українських захисників та захисниць амуніцією та технікою, а також підтримує зовнішні military-проєкти.SKELAR — середовище для самореалізації людей, які здатні створити успішні компанії. Ми такі компанії називаємо the next big everything. Віримо в їх потужність та масштаб.</p><p>Ми плануємо й надалі розвивати tech-бізнеси, підкорювати глобальні ринки та працювати задля перемоги України 🇺🇦</p><p><strong>Для цього створили всі можливості всередині нашого venture builder’a:<br>—</strong> 8 інфраструктурних команд, які допомагають стартапам закривати будь-які питання: від рекрутингу до фінансів та юридичних питань;<br>— Спільнота фаундерів, які вже запустили не один бізнес й можуть ділитися практичним досвідом;<br>— Внутрішні клуби за професійними напрямками: маркетинг, розробка, фінанси, рекрутинг;<br>— Тренінги, курси, відвідування конференцій;<br>— Медичне страхування, корпоративний лікар та психолог.</p><p><strong><em>Давай разом будувати the next big everything!</em></strong></p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/skelar/vacancies/269982/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Wed, 05 Jun 2024 17:46:36 +0300",
        "guid": "https://jobs.dou.ua/companies/skelar/vacancies/269982/?1717598796"
    },
    {
        "title": "Middle Go Software Engineer (Europe) в Inoxoft, за кордоном, віддалено",
        "link": "https://jobs.dou.ua/companies/inoxoft/vacancies/269958/?utm_source=jobsrss",
        "description": "<p><b>Inoxoft</b> is looking for an experienced and professional <strong>Middle Go Software Engineer</strong> to join our team.<br><br></p><p><b>Requirements:</b></p><p>— 3+ years of proven experience in software engineering.</p><p>— Minimum of 3 years hands-on experience with Go programming language.</p><p>— Familiarity with major cloud platforms such as AWS, Azure, or GCP.</p><p>— An innate dynamism, self-direction, and the ability to rapidly grasp new concepts.</p><p>— Intermediate+ English level.</p><p><b>Will be a plus:</b></p><p>— Understanding of various network protocols (HTTP, WebSocjet, etc.)</p><p><b>Responsibilities:</b></p><p>— Architect, develop, and maintain code that is efficient, reusable, and reliable.</p><p>— Spearhead the generation of innovative ideas, features, and enhancements for our product/service.</p><p>— Tackle intricate challenges spanning applications, systems, and infrastructure.</p><p>— Foster seamless collaboration with teammates, technical partners, and management.</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/inoxoft/vacancies/269958/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Wed, 05 Jun 2024 16:23:20 +0300",
        "guid": "https://jobs.dou.ua/companies/inoxoft/vacancies/269958/?1717593800"
    },
    {
        "title": "Back-end (Go) engineer в Rolique, Львів, віддалено",
        "link": "https://jobs.dou.ua/companies/rolique/vacancies/261368/?utm_source=jobsrss",
        "description": "<p>We are actively seeking an experienced Go engineer to join our team. We highly value individuals who demonstrate autonomy, a drive for continuous self-improvement, and a proactive approach to leveraging their expertise.<br>In this role, you’ll collaborate closely with a cohort of driven and exceptionally talented engineers, ensuring that quality, performance, and scalability remain paramount throughout our endeavors.“</p><p>‍<strong>Requirements:</strong></p><p><strong>‍</strong>● 3+ years of commercial experience with Go<br>● strong background in backend development, including RESTful API design, database management (SQL/NoSQL), and server-side architecture<br>● you love patterns and complex challenges, you know how to evaluate solutions and how to choose the right one based on experience and clever decision making<br>● you can work on your own but you love to share your knowledge and work with the team<br>● you bring a software engineering background and an entrepreneurial mindset<br>● english — Upper-intermediate or higher</p><p><strong>Would be a plus:</strong></p><p><strong>‍</strong>● strong experience working with Node.js, PHP or Java</p><p>‍<strong>What you will do:</strong></p><p><strong>‍</strong>● develop high-quality, fast, and reusable code<br>● work with us on the design and implementation of new services and products<br>● take ownership of features from design to implementation and testing to deployment</p><p>‍<strong>Why Rolique?</strong></p><p><strong>‍</strong>● we believe in fairness, transparency and helpfulness in everyday work<br>● your personal development is important to us, therefore we promote the internal transfer of knowledge and strengthen your “zone of genius”<br>● 20 days of paid vacation and 5 days of sick leaves<br>● personal budget for courses, training, and certifications<br>● mental health support and sport compensation<br>● accounting support</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/rolique/vacancies/261368/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Wed, 05 Jun 2024 15:28:45 +0300",
        "guid": "https://jobs.dou.ua/companies/rolique/vacancies/261368/?1717590525"
    },
    {
        "title": "Senior Golang Developer в NCube Ltd., віддалено",
        "link": "https://jobs.dou.ua/companies/ncube/vacancies/269937/?utm_source=jobsrss",
        "description": "<p> We’re looking for a highly experienced Backend Developer to join our client’s team! If you are curious to work with a large scale of data in real-time, committed to translating insights into action, want new challenges daily and impact the lives of millions of users globally, this role is for you! </p> \n\n<p><b> Project — </b> a super-app and an all-in-one platform for everything communications-based, with many different business and financial services, including payment solutions for users to make transfers, purchases, and much more! </p>\n\n\n\n<h4></h4> \n\n<h4><i><u>Must have:</u></i></h4> \n\n<li> 4+ years of experience in server-side development using Go language </li> \n\n<li> Familiarity with Google Cloud Platform (GCP) or AWS </li> \n\n<li> Advanced knowledge of unit testing frameworks and mocking </li> \n\n<li> Experience with microservices development based on Docker </li> \n\n<li> Experience of implementation and maintenance of CI/CD pipelines </li> \n\n<li> Experience with Agile methodology </li> \n\n<li> Striving for new knowledge and skill improvement </li> \n\n<li> Excellent oral and written communication skills </li> \n\n<li> BSc in computer science or equivalent </li> \n\n<li> Upper-Intermediate English and better </li> \n\n<h4></h4> \n\n<h4><i><u>Good to have:</u></i></h4> \n\n<li> Experience with Vue.js framework </li> \n\n<li> Experience with large-scale NoSQL databases (such as Couchbase, MongoDB) </li> \n\n<h4></h4> \n\n<h4><i><u>Responsibilities:</u></i></h4> \n\n<li> Planning, designing, developing, and maintaining high-availability backend applications that can be high-volume and low-latency </li> \n\n<li> Define application objectives and functionality </li> \n\n<li> Ensure application designs conform to business goals </li> \n\n<li> Support continuous improvement, investigating alternatives and technologies, and presenting for architectural review </li> \n\n<li> Work in a highly motivated team, closely with product and Architecture teams on large mission-critical systems </li> \n\n<h4></h4> \n\n<h4><i><u>We offer:</u></i></h4> \n\n<li> Competitive salary </li> \n\n<li> Flexible working schedule, fully remote work opportunities </li> \n\n<li> Taxes compensations </li> \n\n<li> Vacation </li> \n\n<li> Paid sick leaves </li> \n\n<li> Annual bonuses </li> \n\n<li> Direct cooperation with the customer </li> \n\n<li> Great working environment and team spirit </li>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/ncube/vacancies/269937/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Wed, 05 Jun 2024 15:08:53 +0300",
        "guid": "https://jobs.dou.ua/companies/ncube/vacancies/269937/?1717589333"
    },
    {
        "title": "FullStack Software Engineer в Postindustria, віддалено",
        "link": "https://jobs.dou.ua/companies/postindustria/vacancies/269866/?utm_source=jobsrss",
        "description": "<p>To strengthen our team in <strong>Europe</strong>, we are looking for a Ukrainian-speaking FullStack Software Engineer with experience in Golang. We are also open to candidates with expertise in any server-side programming language who are eager to switch to Golang. You will have time to adapt and fully immerse yourself in the role.</p><h3><b>About the project</b></h3><p><a href=\"http://giggster.com\" target=\"_blank\">Giggster</a>, our in-house product, is an online platform for people to list, discover, and book locations for creative projects and events. </p><p>Chances are you’ve seen Giggster locations in the shows you watch, brands you buy, and influencers you follow. Some of the biggest content producers in the world use us for their locations, such as Netflix, HBO, and Disney — as well as top brands like Apple and Louis Vuitton. And the next generation of creators on YouTube, Instagram, and TikTok is also finding perfect spots on Giggster for their content.</p><p>Giggster’s goal is to be the technology disruptor that modernizes Hollywood, empowering millions of creators — no matter where they are — to focus on content rather than the logistics of finding a location and the additional services that go with it, like permitting, etc.</p><p>Founded in 2017, Giggster is a team of 70+ distributed across the US, Europe, and Asia.</p><h3><b>Team members</b></h3><p>6x Fullstack Engineers, 1x iOS Engineer, 4x QA Engineers, Product Designer, Project Manager, Head of ML/DS, CTO.</p><h3><b>Technologies</b></h3><ul><li>Core services language: Golang;</li><li>Frontend stack: Golang SSR + JS (ECMAScript 8);</li><li>Storage/Streaming/FTS: PostgreSQL, Clickhouse, Kafka, Elasticsearch;</li><li>Cloud services: AWS (RDS, EKS, S3, CloudFront).</li></ul><h3><b>Opportunities</b></h3><ul><li>Deliver measurable impact on the company’s success</li><li>Experience with an in-demand stack of technologies </li><li>Integration with widely used third-party and partner services</li><li>Meaningful work — contribute directly to the development of a product that helps real-world businesses and individuals</li></ul><h3><b>Expertise you need</b></h3><ul><li>Excellent knowledge of any general-purpose programming language (although you’ll be working with Golang &amp; JS)</li><li>Knowledge of JS / ECMAScript 8+</li><li>Experience with both, backend and frontend web development</li><li>Good understanding and experience with any general-use RDMS (Postgres, MySQL, MS SQL, etc)</li><li>General understanding of the principles of Unix-like systems and networking</li><li>English level: Upper-Intermediate</li><li>Ukrainian level: Upper-Intermediate</li></ul><h3><b>Why us</b></h3><p><b>Cozy office or home environment</b></p><ul><li>Daily use of modern technologies;</li><li>Flexible working hours;</li><li>Ability to work remotely.</li></ul><p><b>Professional development and advancement</b></p><ul><li>Regular 1 on 1 feedback on development and performance;</li><li>Budget for education (books, online courses);</li><li>Compensation for English lessons;</li><li>Visit and speak at conferences and technological events worldwide;</li><li>Performance-based bonuses;</li><li>Technical and career mentorship and guidance.</li></ul><p><b>Team culture</b></p><ul><li>Experienced and enthusiastic multinational team;</li><li>Knowledge-sharing culture;</li><li>Each employee is responsible for their part of the job so we appreciate the ability to self-organize and prioritize tasks;</li><li>Referral program — if you want to work even more comfortably, being surrounded by some of your friends, we’ll pay for that up to 1500$ (depending on the candidate level).</li></ul><p><b>Out-of-work care</b></p><ul><li>Days off for all public holidays;</li><li>Annual leave of 20 working days and 5 days of sick leave;</li><li>Compensation for medical expenses;</li><li>Paid leave for all important events in your private life;</li><li>Financial incentives for the wedding or birth of a child;</li><li>Christmas bonus.</li></ul><p><b>Next steps</b></p><ul><li><nobr>30-minute</nobr> intro with HR.</li></ul><p>That’s small talk about the company, products, team, position, technology stack, etc.</p><ul><li><nobr>2-hour</nobr> technical interview with the CTO.</li></ul><p>In this interview, we will dive deeper into your experience and technical knowledge and have more time to discuss all questions relevant to you.</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/postindustria/vacancies/269866/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Wed, 05 Jun 2024 11:00:07 +0300",
        "guid": "https://jobs.dou.ua/companies/postindustria/vacancies/269866/?1717574407"
    },
    {
        "title": "Golang developer в Облтелеком, $2000–4000, смт. Калинівка, віддалено",
        "link": "https://jobs.dou.ua/companies/obltelekom/vacancies/233158/?utm_source=jobsrss",
        "description": "<p>У звʼязку з відкриттям нового напрямку діяльності компанії шукаємо в команду розробника Golang.</p><p>Підпорядкування IT директору компанії.</p><p><strong>Основні задачі: </strong></p><ul><li>розробка backend білінгової системи оператора та суміжних систем управління мережевим обладнанням в команді з frontend розробником;</li><li>розробка та підтримка застосунків для роботи з socks5 та openVPN для OS Linux на базі мікросервісної архітектури.</li></ul><p><strong>Потрібен:</strong></p><ul><li>досвід роботи з git, Prometeus, MongoDB</li><li>розуміння та досвід роботи з graphql та rest</li><li>досвід взаємодії з мережевим серверним обладнанням</li><li>розуміння архітектури побудови білінгових систем</li></ul><p>Вміння самостійно вести проект, визначати та планувати задачі, пропонувати оптимальні варіанти вирішення поставлених задач з боку бізнесу і компанії.</p><p>Фактично ви будете головним in-house розробником в компанії, маєте повну свободу дій для вирішення поставлених задач, бдуете мати можливість безпосередньо бачити результати своєї роботи.</p><p><strong>Взаємодія:</strong></p><ul><li>безпосередньо з керівним складом компанії</li><li>функціонально з відділом NOC.</li></ul><p>Можлива віддалена робота із відвіданням офісу декілька раз в місяць.</p><p>Будь-яка форма оплати та працевлаштування.</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/obltelekom/vacancies/233158/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Tue, 04 Jun 2024 18:00:18 +0300",
        "guid": "https://jobs.dou.ua/companies/obltelekom/vacancies/233158/?1717513218"
    },
    {
        "title": "Software Engineer (Go) в PIN-UP.TECH, Варшава (Польща), Лімасол (Кіпр), Алмати (Казахстан), віддалено",
        "link": "https://jobs.dou.ua/companies/pin-up-tech/vacancies/269810/?utm_source=jobsrss",
        "description": "<p><a href=\"http://pin-up.tech/\" target=\"_blank\">PIN-UP.TECH</a> is one of the directions of the international ecosystem PIN-UP Global, which operates in six countries — Ukraine, Poland, Kazakhstan, Cyprus, Peru, and Armenia. <a href=\"http://pin-up.tech/\" target=\"_blank\">PIN-UP.TECH</a> is the foundation of today’s international ecosystem of PIN-UP Global, the main products of <a href=\"http://pin-up.tech/\" target=\"_blank\">PIN-UP.TECH</a> are platforms for Ukraine and Kazakhstan. PIN-UP Global is an ecosystem of independent companies involved in the life cycle of various entertainment products. Ecosystem companies introduce innovative technologies, non-standard solutions for the development and scaling of products and services.</p><p><strong>We are looking for a Software Engineer (Go) to join our team.</strong></p><p><strong>Requirements:</strong></p><p>• Development experience for Go 2+ years;<br>• Time management and organizational skills;<br>• Ability to design and implement scalable and reliable software solutions;<br>• Excellent problem-solving skills;<br>• Git, GitLab , GitLab CI;<br>• Experience with multiple databases (RDMBS, NoSQL, SQL, Redis, ...) and messaging services (Kafka, NATS, ...), ideally run in a cloud (e.g. AWS);<br>• Strong system design skills;<br>• REST/RPC transports;<br>• Practical knowledge of containers (Docker, Kubernetes);<br>• Experience with micro-services design and development;<br>• Understanding of the importance of well-organized codebase and documentation;</p><p><strong>Responsibilities:</strong></p><p>• Participate in code reviews to ensure code quality and distribute knowledge;<br>• Integrate renowned third-party services;<br>• Write high-performance, testable, and maintainable code to implement new functionality;<br>• Take part in technical discussions to come up with solutions for challenging issues;<br>• Mentorship, knowledge sharing with team;</p><p><strong>Will be plus:</strong></p><p>• Understanding event-driven architecture;<br>• Understanding Twelve-Factor App methodology;<br>• Cloud Events;<br>• Working with cloud services GCP\\AWS;<br>• GitOps;<br>• Terraform;<br>• Helm\\Argocd;<br>• Grafana\\Tempo\\Loki + Prometheus;<br>• High load systems;</p><p><strong>Our benefits to you:</strong></p><p>🍀An exciting and challenging job in a fast-growing product ecosystem, the opportunity to be part of a multicultural team of top professionals in Development, Engineering and Architecture, Management, Operations, Marketing, etc;<br>🤝Great working atmosphere with passionate IT experts and leaders, sharing a friendly culture and a success-driven mindset is guaranteed;<br>📍Beautiful offices in Kyiv, Warsaw, Limassol, Almaty, Yerevan — work with comfort and enjoy the opportunity to build a network of connections with IT professionals day by day;<br>🧑‍💻Laptop &amp; all necessary equipment for work according to the ecosystem standards;<br>🏖Paid vacations, personal events days, days off;<br>🫖Paid sick leave;<br>👨‍⚕Medical insurance;<br>💵Referral program — enjoy cooperation with your colleagues and get the bonus;<br>📚Educational support by our L&amp;D team: internal and external trainings and conferences, courses on Udemy;<br>🗣Free internal English courses;<br>🤸‍♀Sport benefit;<br>🦄Multiple internal activities: online platform with newsletters, quests, gamification and presents for collecting bonuses, PIN-UP talks club for movie and books lovers, board games cozy evenings, special office days dedicated to holidays, etc;<br>🎳Company events, team buildings.</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/pin-up-tech/vacancies/269810/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Tue, 04 Jun 2024 16:24:50 +0300",
        "guid": "https://jobs.dou.ua/companies/pin-up-tech/vacancies/269810/?1717507490"
    },
    {
        "title": "Middle Golang Developer в Beetroot, Київ, Львів, Одеса, Івано-Франківськ, Кременчук, Полтава, Познань (Польща), віддалено",
        "link": "https://jobs.dou.ua/companies/beetroot/vacancies/269800/?utm_source=jobsrss",
        "description": "<p>We are looking for a talented<strong> Golang Developer</strong> to join our team and help shape the future of innovative marketing strategies and product propositions for our clients across various industries.</p><p>Our Client team — is a leading marketing agency that shapes trends and creates data-driven solutions for clients across various domains, including healthcare, fintech, public safety, and justice. Their team of specialists combines innovative marketing techniques with deep industry understanding to develop user-centered design stories and product propositions. They manage several projects with several teams and are looking for new team members. So we are seeking a skilled Golang Developer with 2 years of experience in the Go programming language to join our team.</p><p>As a Golang Developer, you will be responsible for designing, developing, and maintaining high-performance, scalable applications and services using Go. You should have strong knowledge of concurrency models and parallel computing, as well as experience with pointers and memory management.</p><p><b>What you’ll do in this role </b> </p><ul><li>Design, develop, and maintain robust and scalable software solutions using the Go programming language.</li><li>Collaborate with cross-functional teams to define, design, and ship new features.</li><li>Write clean, efficient, and maintainable code following best practices.</li><li>Troubleshoot and debug complex issues in existing systems.</li><li>Optimize applications for maximum performance and scalability.</li><li>Participate in code reviews to ensure code quality and adherence to coding standards.</li><li>Stay up-to-date with the latest industry trends and technologies.</li></ul><p><b>We’re looking for</b></p><ul><li><nobr>3-5</nobr> years of general experience in the field.</li><li><nobr>1-2</nobr> years of experience with the Go programming language.</li><li>Strong knowledge of concurrency models and parallel computing.</li><li>Experience with pointers and memory management.</li><li>Experience with databases, writing SQL queries, and NoSQL.</li><li>Knowledge of high availability applications, replication, and stateless applications.</li><li>Experience with message queues and asynchronous programming.</li><li>Familiarity with observability, logging, tracing, and alerting.</li><li>Excellent English communication skills, at least upper-intermediate level.</li></ul><p><b>How to knock our socks off</b></p><ul><li>Bachelor’s degree in Computer Science, Engineering, or a related field.</li><li>Experience with containerization technologies such as Docker and Kubernetes.</li><li>Experience with microservices architecture.</li><li>Knowledge of front-end technologies such as HTML, CSS, and JavaScript.</li><li>Naming five or more dishes that include Beetroot, besides borshch ;)</li></ul><p>✔ <b>Not checking every box?</b></p><p>This job looks very exciting, but you hesitate to apply because of the confidence gap? Reach out to us anyway! Beetroot is an inclusive workplace that considers all applicants. Equality is one of our core values. We’re committed to providing equal opportunity and a sense of belonging for all Beetroot consultants and candidates. So let’s discover together whether we could be an excellent fit for each other. </p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/beetroot/vacancies/269800/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Tue, 04 Jun 2024 16:09:36 +0300",
        "guid": "https://jobs.dou.ua/companies/beetroot/vacancies/269800/?1717506576"
    },
    {
        "title": "Golang Backend developer (Promova) в BOOSTERS (partner of Genesis), Київ, віддалено",
        "link": "https://jobs.dou.ua/companies/boosters-product-team/vacancies/266743/?utm_source=jobsrss",
        "description": "<p>We are<a href=\"https://boosters.team/\" target=\"_blank\"> Boosters</a>, a team of professionals creating fast-growing mobile products that improve the quality of life for millions of customers around the world. With a total audience of more than <strong>22 million users</strong>, our products consistently rank among the TOP apps worldwide.</p><p>Our greatest asset<strong> is people </strong>— individuals who are driven to grow, develop, and exchange their knowledge.<strong> We currently have 120+ members </strong>on our team, and we don’t plan to stop!</p><p>We are currently looking for a <strong>Golang Backend Developer </strong>to join our dynamic Promova team.</p><p><a href=\"http://promova.com/\" target=\"_blank\">Promova</a> is a one-stop language learning platform that includes a mobile app, conversation clubs, group classes and one-to-one lessons with tutors. We have a popular website, media presence, and active socials. Our app has been downloaded more than <strong>15 million times</strong>, and our learners completed over <strong>35 million lessons</strong> over the last few years. Our goal for the next 2 years is to secure a spot among the top 5 online language learning services worldwide. Looking ahead, within the next five years, we aim to achieve the status of a unicorn company with Ukrainian roots! </p><p>ABOUT YOU:</p><ul><li>2+ years of development experience;</li><li>At least one year of commercial expertise with Golang;</li><li>Experience Proficiency with MongoDB, PostgreSQL;</li><li>Experience with OpenAI or other LLM;</li><li>Competence in code coverage with tests: module, integration, functional, e2e;</li><li>Understanding of asynchronous programming;</li><li>Ability to estimate time and find optimal solutions.</li></ul><h3>YOUR AREA OF IMPACT:</h3><ul><li>Implementation of Backend solutions on Go;</li><li>Implementation of new technologies and approaches in development;</li><li>Search and implementation of optimal technical solutions (quality/speed);</li><li>Functionality coverage with tests.</li></ul><h3>WHAT WE OFFER:</h3><ul><li>Work in a team of professionals with a monthly audience of over one million;</li><li>Philosophy and conditions for your constant growth and development;</li><li>Numerous opportunities for implementing your ideas and influencing the product.</li></ul><h3>CORPORATE BENEFITS:</h3><ul><li>Corporate doctor and medical insurance;</li><li>Compensation for additional training at external training events and seminars</li><li>Business and Management School for employees;</li><li>A large electronic library and access to paid online courses and conferences, internal discussions and workshops, and English courses.</li></ul><p>INTERVIEW PROCESS:</p><ul><li>Pre-screen with a recruiter (40 minutes)</li><li>Test task</li><li>Interview with Tech Lead (1.5 hours)</li><li>Bar-raising (1.5 hours)</li></ul><h3>Hit that apply button and let’s create some unicorns together! 🦄</h3>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/boosters-product-team/vacancies/266743/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Tue, 04 Jun 2024 10:45:44 +0300",
        "guid": "https://jobs.dou.ua/companies/boosters-product-team/vacancies/266743/?1717487144"
    },
    {
        "title": "Golang developer в LLC Proxima Research International, Київ, віддалено",
        "link": "https://jobs.dou.ua/companies/teamsoft/vacancies/269691/?utm_source=jobsrss",
        "description": "<p><i><strong>Basic requirements</strong></i></p><ul><li>1+ years of commercial development in Golang</li><li>Willingness to independently solve assigned tasks</li><li>Knowledge of SQL</li><li>Experience with REST API</li><li>Experience writing Unit/Integration tests</li></ul><p><em><strong>Optional requirements</strong></em></p><ul><li>Experience with non-relational DBMS</li><li>Knowledge of microservice architecture fundamentals</li></ul><p><i><strong>Tasks for the first month of work</strong></i></p><ul><li>Thorough onboarding and immersion in the specifics of the project</li></ul><p> <i><strong>Tasks for the next 3 months of work</strong></i></p><ul><li>Help in refactoring legacy code of an existing application</li><li>Autotest coverage of the existing code base</li><li>Identifying critical problems in the application and fixing them</li></ul><p><strong>We offer:</strong></p><p>🌟Competitive salary depending on your experience</p><p>🌟Professional development opportunities</p><p>🌟Compensation package (paid vacation, sick leaves)</p><p>🌟Flexible working hours (from <nobr>9-11</nobr> to <nobr>18-20)</nobr> </p><p><i><strong>Ready for a new step in your career? Send your application, and we’ll get back to you!</strong></i></p><p> </p><p><i><strong>🚀 Apply today!</strong></i></p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/teamsoft/vacancies/269691/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Tue, 04 Jun 2024 10:35:51 +0300",
        "guid": "https://jobs.dou.ua/companies/teamsoft/vacancies/269691/?1717486551"
    },
    {
        "title": "Middle Go+Flutter Developer в FAVBET Tech, Київ, віддалено",
        "link": "https://jobs.dou.ua/companies/favbet/vacancies/269623/?utm_source=jobsrss",
        "description": "<p><strong>FAVBET Tech</strong> розробляє програмне забезпечення, яким користуються мільйони гравців у всьому світі, для міжнародної компанії FAVBET Entertainment.<br>Ми розробляємо інновації у сфері гемблінгу та беттінгу через складну багатокомпонентну платформу, яка здатна витримувати величезні навантаження та надавати унікальний досвід для гравців.<br><strong>FAVBET Tech</strong> не займається організацією та проведенням азартних ігор на своїй платформі. Її головний фокус — розробка програмного забезпечення.</p><p><strong>Основні напрямки роботи:</strong></p><ul><li>Betting/Gambling Platform Software Development — розробка програмного забезпечення, комфортного у використанні та персоналізованого під кожного клієнта.</li><li>Highload Development — розробка високонавантажених сервісів та систем.</li><li>CRM System Development — розробка низки сервісів для забезпечення високого рівня обслуговування клієнтів, ефективного залучення нових клієнтів та утримання наявних.</li><li>Big Data — створюємо складні системи для обробки та аналізу великих даних.</li><li>Cloud Services — використовуємо хмарні технології для масштабування та ефективності бізнесу.</li></ul><p><b>Основні завдання:</b></p><ul><li>Розробка нового функціоналу для продукту;</li><li>Підтримка та удосконалення наявної кодової бази;</li><li>Написання тестів для бізнес логіки на стороні Backend;</li></ul><p><b>Для нас важливо:</b></p><ul><li>2+ рік досвіду програмування на Go;</li><li>1+ рік досвіду роботи з Flutter;</li><li>Досвід роботи PostgreSQL;</li><li>Досвід роботи з OpenAPI;</li><li>Навички написання модульних/інтеграційних тестів;</li></ul><p><b> </b><b>Буде плюсом:</b></p><ul><li>Досвід роботи з Websocket, gRCP;</li><li>Досвід роботи з Kibana, Jaeger;<br></li></ul><p><b><b>Ми пропонуємо:</b> <br></b></p><ul><li>24 календарні дні оплачуваної відпустки та компенсація 10 лікарняних;</li><li>Медичне страхування або абонемент в спортзал;</li><li>Безкоштовні корпоративні курси англійської мови;</li><li>Можливість працювати у власному сучасному та зручному офісі (біля станції м. Почайна);</li><li>Гнучкий графік роботи — повну зайнятість без надмірної бюрократії, мікроменеджменту та відстеження робочого часу.</li></ul>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/favbet/vacancies/269623/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 03 Jun 2024 16:11:40 +0300",
        "guid": "https://jobs.dou.ua/companies/favbet/vacancies/269623/?1717420300"
    },
    {
        "title": "Back-end Engineer (Golang) в Gismart, за кордоном",
        "link": "https://jobs.dou.ua/companies/gismart_com/vacancies/269600/?utm_source=jobsrss",
        "description": "<p><b>About us:</b></p><p>Gismart is a value-driven mobile app developer with a strong presence in the Health &amp; Wellness, Utilities, and Music app markets. We have recently achieved a significant milestone of over 1 billion downloads worldwide, taking a step toward our mission of cultivating the well-being of people worldwide. With headquarters in London, UK, Gismart is a dynamic global company with a reach extending across Europe and far beyond. Our determined team comprises over 250 individuals who bring diversity, creativity, innovation, and relentless drive to the company. Gismart unites professionals from diverse backgrounds in entertainment, music, and tech, allowing us to play to each other’s strengths and succeed as a team. </p><p>Our mission:<br><b>Become a stepping stone on our customers’ journeys of self-improvement.</b></p><p>Our values:</p><ul><li><b>Growth</b>: The essence of life is curiosity, so we never stop learning, discovering, and growing both as individuals and as a company.</li><li><b>Impact</b>: Be a force for good and pay it forward.</li><li><b>Trust</b>: Trust is earned when actions meet words.</li><li><b>Honesty</b>: Have the courage to face the truth.</li><li><b>Balance</b>: The formula is unique for everyone but essential for a fulfilling life.</li></ul><p>If you are passionate about mobile app development and want to join a company that’s reshaping the industry, Gismart is the place for you. We provide exciting career opportunities, a supportive workplace culture, and the chance to contribute to a team that is making a tangible impact. For more information on Gismart, visit <a href=\"https://gismart.com/\" target=\"_blank\">gismart.com</a>.</p><p><b>Responsibilities:</b></p><ul><li>Develop and support billing services used in the company’s products</li></ul><p><b>Requirements:</b></p><ul><li>3+ years of backend development experience</li><li>1+ years of Golang development experience</li><li>Strong knowledge of relational databases </li><li>Experience with Kafka or similar systems</li><li>Basic knowledge of K8s</li></ul><p><b>Tech stack:</b></p><ul><li>Golang</li><li>Postgres</li><li>Kafka</li><li>K8s</li><li>Docker</li><li>AWS</li><li>Prometheus</li><li>Temporal</li></ul><p><b>Nice-to-have:</b></p><ul><li>Experience with Docker, docker-compose</li><li>Billing/payment system development experience</li></ul><p><strong>** Location: Poland<b>/EU</b></strong></p><p><b>Employee Benefits:</b></p><ul><li><b>Remote-First Culture:</b> Our team is diverse and extensive, just like our product portfolio. We provide a flexible working schedule and let you work anywhere in the world, either remotely or in one of our corporate hubs.</li><li><b>Relocation Program:</b> Gismart offers a relocation package to Poland as well as legalization and accounting support to all employees.</li><li><b>Сoworking Compensation: </b>We provide 50% compensation for coworking spaces worldwide to make sure that everyone has a comfortable and inspiring workspace.</li><li><b>Flexible Public Holidays Policy:</b> Gismart provides its employees with 6 fixed public holidays per year and gives you the freedom to choose 5 additional holidays to your liking.</li><li><b>100% Sick Leave Compensation</b></li><li><b>Mental and Physical Health:</b> To help you stay happy and healthy, Gismart will cover your medical insurance, 75% of your sports activities, and 70% of your therapy costs.</li><li><b>Personal Equipment Policy:</b> Of course, we’ll provide you with all the equipment you need or cover the maintenance cost for your own tools.</li><li><b>Personal Learning and Development:</b> We love to see you learn and grow, so Gismart will cover 70% of your professional development courses. We’ll also pay for 80% of corporate English courses. </li><li><b>Time-Off Policy:</b> Every employee gets 18 working days of paid vacation and 3 personal days per year, with an extra day added for each year at Gismart.</li><li><b>Corporate Events:</b> We are remote-first, but we love meeting up in person. Whenever possible, we organize corporate events and team-building activities across all Gismart hubs.</li></ul>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/gismart_com/vacancies/269600/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 03 Jun 2024 14:43:24 +0300",
        "guid": "https://jobs.dou.ua/companies/gismart_com/vacancies/269600/?1717415004"
    },
    {
        "title": "Middle Golang Developer в Nova Digital, віддалено",
        "link": "https://jobs.dou.ua/companies/nova-digital/vacancies/263299/?utm_source=jobsrss",
        "description": "<p>The Ukrainian IT company <strong>Nova Digital</strong>, part of the NOVA group of companies, is a powerful developer of web applications and software for architectures of any complexity and workload. We create, maintain, and continuously improve software products, the convenience of which has already been appreciated by 32 million private and business clients of Nova Poshta. As we expand our team, we are currently looking for a <strong>Middle Golang Developer</strong> <br> </p><p><strong>Job Description</strong> <br><br>We are seeking a talented Golang Developer to join our dynamic team. Your primary responsibilities will include implementing new functional requirements, developing and maintaining existing services, enhancing current functionality, writing tests, and conducting code reviews. If you have experience with OAuth 2.0 authorization, especially with Ory Hydra, and are a collaborative team player, we would love to hear from you!<br><br><strong>Responsibilities</strong></p><ul><li>Innovate and Implement: Develop new features and enhance existing ones to meet functional requirements</li><li>Maintain and Support: Ensure the reliability and efficiency of existing services through diligent maintenance and timely updates</li><li>Test and Ensure Quality: Write comprehensive tests to guarantee the stability and performance of our codebase</li><li>Collaborate and Review: Participate in code reviews, sharing your expertise and learning from peers to uphold high coding standards</li></ul><p><strong>Requirements</strong></p><ul><li>Experience: At least 3+ years of commercial software development experience with Golang as your primary programming language</li><li>API Expertise: Strong knowledge of API design, including REST API, RPC (mux), 3rd party API implementation, and RESTful principles</li><li>Software Design: Solid experience in software design and architecture</li><li>gRPC Proficiency: Proven experience with gRPC</li><li>Tool Proficiency: Familiarity with Jira, GitHub, and BitBucket</li><li>Database Skills: Good knowledge of SQL and experience with relational databases</li><li><strong>OAuth 2.0 Authorization: Experience with OAuth 2.0, preferably using Ory Hydra</strong></li><li>IAM Knowledge: Experience integrating authentication and authorization systems, and working with Identity and Access Management (IAM) tools</li><li>Microservices Architecture: Understanding of microservices architecture principles</li><li>Containerization: Experience with containerization systems like Docker and Kubernetes</li><li>Version Control: Proficient with Git and other version control systems</li><li>English Proficiency: English level B1 or higher</li></ul><p><strong>Preferred Qualifications</strong></p><ul><li>GraphQL: Experience with GraphQL</li><li>Testing: Experience writing unit and integration tests</li><li>Agile Methodologies: Knowledge and practice of Agile/Scrum methodologies</li><li>CI/CD: Experience setting up Continuous Integration and Continuous Deployment (CI/CD) pipelines</li><li>About You:<br>— Team Player: You thrive in a collaborative environment and are always ready to help and seek help when needed<br>— Innovative: You are passionate about technology and eager to stay updated with the latest trends</li></ul><p><strong> We offer</strong></p><ul><li>Official employment</li><li>Medical Insurance</li><li>Paid vacation</li><li>Necessary equipment for work</li><li>A corporate culture that motivates and charges with positivity</li><li>Work in socially responsible companies that follows trends, appreciates the ideas of employees and develops together with them<br> </li></ul><p>Send your resume, let’s get to know each other :)</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/nova-digital/vacancies/263299/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 03 Jun 2024 12:15:58 +0300",
        "guid": "https://jobs.dou.ua/companies/nova-digital/vacancies/263299/?1717406158"
    },
    {
        "title": "Software Engineer в Solidgate, Київ, Варшава (Польща), віддалено",
        "link": "https://jobs.dou.ua/companies/solidgate/vacancies/262727/?utm_source=jobsrss",
        "description": "<p><a href=\"https://solidgate.com/\" target=\"_blank\"><b>Solidgate</b></a> — це платформа для оркестрації та процесингу платежів, що допомагає тисячам компаній приймати платежі онлайн. Ми розробляємо інноваційні фінтех-рішення, щоб забезпечити безперебійну обробку платежів для бізнесів у понад 150 країнах світу, від Європи до ЛАТАМу, від США до Азії. Пишаємось бути частиною історії кожної компанії, з якою працюємо — наша інфраструктура гарантує швидкий скейл на нових ринках та збільшення прибутків.</p><p><b>Про нас:</b> <br>— Офіси в 3х країнах: Україні, Польщі та на Кіпрі<br>— Топовий роботодавець за версією DOU<br>— 170+ людей в команді<br>— 200+ клієнтів з України, Європи та США<br>— Статус Principal Member у Visa та Mastercard<br>— Ліцензія ЕМІ в ЄС</p><p><b>Наші переваги:</b> <br>— FinTech — швидкозростаюча індустрія<br>— Backend-driven продукт зі складними логіками, архітектурою та <a href=\"https://solidgate-tech.github.io/\" target=\"_blank\">сучасним стеком технологій </a><i><br></i>— складні виклики та прямий вплив кожного члена команди на ріст бізнесу<br>— можливість розвитку та професійного росту — «career plan» є у кожного<br>— команда, яка горить спільною метою, має спільне бачення та цінності<br><br>Крім того, <b>ми забезпечуємо швидкі донати для української армії</b>! Команда Solidgate створила<a href=\"https://ain.ua/2022/07/29/charity-payment-link/\" target=\"_blank\"> <b>Payment Link</b></a>, завдяки якому БО та фонди можуть приймати платежі за лічені хвилини у будь-якій валюті. Пишаємося партнерствами з благодійними організаціями, серед яких<a href=\"https://www.koloua.com/\" target=\"_blank\"><b> KOLO</b></a><b> та</b><a href=\"https://savelife.in.ua/\" target=\"_blank\"><b> «Повернись живим»</b></a><b>.</b></p><p>Ми відкриваємо можливість для амбітних T-shaped інженерів, яким близький Tech-Agnostic підхід і, які готові змінити стек аби попрацювати над комплексним фінтех продуктом. Нижче ти дізнаєшся більше про команди і виклики, які тебе очікуватимуть в кожній з них. <br><br><b>Core</b> — центральна команда компанії, яка відповідає за розвиток системи обробки платежів.<br><br><b>Виклики цієї команди: </b></p><ul><li>розробка таких сервісів як роутинг платежів між провайдерами, процесинг 3DS платежів, сервіс по роботі з BIN, асинхронний фінансовий звіт;</li><li>проектування нової платіжної архітектури;</li><li>пошук стійких архітектурних підходів для процесингу потоку фінансових транзакцій в екосистемі продукту;</li><li>робота над reliability всієї платіжної системи.</li></ul><p><b>Chargeback Prevention </b>—<b> </b>команда, яка відповідає за розвиток сервісів, що допомагають нашим клієнтам зменшувати ризики, пов’язані з фродовою діяльністю платників.<br><br><b>Виклики цієї команди:</b></p><ul><li>Інтеграція з різними Chargeback Prevention сервісами по типу Ethoca та Verifii;<br>Розвиток власного розумного Antifraud сервісу та Risks сервісу, який опрацьовує Chargebacks та Fraud alerts;</li><li>Розробка та подальший розвиток адмінки сервісу;</li><li>Покращення коду, архітектури, сервісів, а також підходів до розробки, моніторингу, логування</li></ul><p><b>Отже, що потрібно, аби приєднатися до нас:</b></p><ul><li>5+ років досвіду в розробці комерційного софту на Node.js/C#/PHP/Java/Kotlin/Python;</li><li>покриття коду тестами для тебе це must;</li><li>досвід побудови високонавантажених систем;</li><li>досвід роботи з реляційними базами даних PostgreSQL або MySQL;</li><li>досвід роботи з message brokers: RabbitMQ/Kafka/Nats;</li><li>використання DevOps принципів в day2day роботі;</li><li>вміння працювати як в команді, так і самостійно;</li><li>ініціативність та вміння приймати рішення;</li><li>проактивність і націленість на результат;</li><li>високий рівень самоорганізації та самонавчання.</li></ul><p><br><b>Круто, якщо ти маєш:</b></p><ul><li>досвід роботи у фінтех чи фінансовій сфері;</li><li>пет проєкти на Go/Kotlin/Java;</li><li>досвід з Docker, K8S;</li><li>досвід з сервісами Amazon. </li></ul><p><b>Наші корпоративні бенефіти:</b> <br>— медичне страхування та корпоративний лікар<br>— понад 30 дей оффів протягом року (20 робочих днів відпустки + вихідні на державні свята)<br>— безкоштовні снеки, сніданки та обіди в офісі<br>— професійне навчання (курси, тренінги, конференції, сертифікації)<br>— performance review 2 рази на рік<br>— компенсація спорту/клуби за інтересами<br>— конкурентна оплата праці<br>— сучасна техніка Apple</p><p><b>Хочеш стати частиною команди?</b> <br>Тоді відкинь усі сумніви та сміливо натискай «<b>відгукнутися на вакансію</b>» 😉</p><p><b>Ми завжди відкриті до рекомендацій талановитих людей!</b></p><p>Тож якщо ти хочеш порекомендувати свого знайомого на одну з наших вакансій — це можна зробити <a href=\"https://form.jotform.com/232353680514352\" target=\"_blank\"><b>тут</b></a>. У випадку успішного найму — віддячимо бонусом!</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/solidgate/vacancies/262727/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 03 Jun 2024 10:14:37 +0300",
        "guid": "https://jobs.dou.ua/companies/solidgate/vacancies/262727/?1717398877"
    },
    {
        "title": "Senior C++/Golang/Java Linux Networking Engineer в Delphi Software, Київ, Вінниця, віддалено",
        "link": "https://jobs.dou.ua/companies/delphi-llc/vacancies/238823/?utm_source=jobsrss",
        "description": "<p><strong>Perimeter 81</strong>, as part of Check Point, is a leading cybersecurity unicorn that is reshaping the way businesses connect their employees and resources in the modern digital era of cloud and remote work. Recognized as a Gartner Cool Vendor and Forrester New Wave Leader™, we have secured over $100M in funding from top-tier investors such as Insight Partners, B-Capital, and Toba Capital. With over 200 employees spread across offices in New York, Los Angeles, and Tel-Aviv, we offer a global and multicultural work environment. Serving more than 2,800 customers, including leading businesses of all sizes and industries, we are experiencing rapid growth.</p><p>Join us and be part of a team that values innovation, collaboration, and excellence in cybersecurity!</p><p><br><br><b>RESPONSIBILITIES</b> <br>— Design and develop secure, scalable applications on the Linux platform<br>— Engineer sophisticated cloud network solutions<br>— Investigate and prototype novel technologies<br>— Maintain high-performing, scalable, and testable code<br>— Engage in collaborative coding and peer reviewing<br>— Interact with developers from different teams<br><br><b>SKILLS</b> <br>— 5+ years of professional software engineering experience<br>— 3+ years of experience with C++/Java/Golang development of networking applications<br>— 5+ years of proven experience in networking:<br> — experiencing protocols and packets in bare hands<br> — in-depth knowledge of switching, routing, handshake protocols, encryption, tunneling, and data transportation<br>— Confirmed skillset in architecture and design of distributed services<br>— Verified proficiency with:<br> — Linux-based systems<br> — cloud environment<br> — modern development and DevOps environments, tools, and practices<br>— Nice to have experience with:<br> — NoSQL databases<br> — Hashicorp stack (Consul, Vault, Nomad)<br>— Upper-Intermediate level of English<br><br><b>WE OFFER</b> <br>— Work in a creative friendly environment using cutting-edge technologies<br>— Work-life balance and flexible schedule<br>— Competitive compensation with focus on your expectations; annual salary review<br>— <nobr>24-day</nobr> paid vacation and 100% paid sick leave<br>— Financial support and legal support for individual entrepreneurs from our side<br>— Professional, language and soft skills trainings<br>— Health insurance coverage: individual and family, fitness plan</p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/delphi-llc/vacancies/238823/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Mon, 03 Jun 2024 08:52:01 +0300",
        "guid": "https://jobs.dou.ua/companies/delphi-llc/vacancies/238823/?1717393921"
    },
    {
        "title": "Golang Developer в Gemini Advisory, віддалено",
        "link": "https://jobs.dou.ua/companies/geminia/vacancies/110155/?utm_source=jobsrss",
        "description": "<h3>Необхідні навички</h3>\n<p>—Golang<br>—Apache Kafka<br>—NoSQL: Elastic, MongoDB,Redis<br>—А Bachelor’s Degree in Computer Science or a related field of study, or some other similar level of educational background, is preferred.</p>\n\n    <h3>Буде плюсом</h3>\n    <p>Frameworks:<br>—lxml — Processing XML and HTML with Python<br>—Beautiful Soup: We called him Tortoise because he taught us.<br>—Scrapy | A Fast and Powerful Scraping and Web Crawling Framework</p>\n\n<p>—Python/Java<br>—GitLab CI/CD<br>—Docker/Kubernetes</p>\n\n    <h3>Пропонуємо</h3>\n    <p>—The company offers Stock Options<br>—Become part of an international product team<br>—Remote work and flexible working schedule<br>—Long-term collaboration<br>—Paid sick leaves and vacation<br>—Performance bonus program<br>—Working with a team of senior, like-minded developers and develop yourself in the best possible environment</p>\n\n    <h3>Обов’язки</h3>\n    <p>—Build scalable, highly available, robust systems and ensure their continuous delivery<br>—Work as part of a cluster and within a cross-functional team<br>—Take part in the whole feature development process — from the inception of ideas to deployment and maintenance <br>—We suggest submitting a small portfolio, or at least a code sample as proof of this experience<br>—Able to log time spent against the correct tickets and help maintain a strong degree of team efficiency.<br>—Prepare a development plan, defend it, code it, ship it, own it!</p>\n\n    <h3>Про проєкт</h3>\n    <p>We are looking for Talented Golang Developers to extend the Recorded Future Payment Fraud Intelligence product team. You will join a product team on the active development stage and work on new features development as well as multiple product integrations with external services.</p>\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/geminia/vacancies/110155/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Sun, 02 Jun 2024 17:16:30 +0300",
        "guid": "https://jobs.dou.ua/companies/geminia/vacancies/110155/?1717337790"
    },
    {
        "title": "Golang Developer в Everstake, віддалено",
        "link": "https://jobs.dou.ua/companies/everstake-company/vacancies/264447/?utm_source=jobsrss",
        "description": "<p><b>The Daily</b> <br>— Research a wide range of edge blockchain technologies that are relevant to bridging techniques<br>— Play a key role in architectural and design decisions<br>— Help developers during development and support cycles<br>— Identify, prioritize and execute tasks in the software development life cycle<br>— Write scalable, robust, testable, efficient, and easy to maintain code<br>— Automate tasks through appropriate tools and scripts<br>— Document development phases and monitor systems<br><br><b>The Essentials</b> <br>— 2+ years of programming experience <br>— 2+ years experience with Golang <br>— Deep knowledge and experience working with SQL and NoSQL databases<br>— Experience in operating system administration — Linux <br>— Solid knowledge of networking protocols (TCP, HTTP, UDP etc)<br>— Experience with REST, RPC<br>— Experience with unit/ integration tests<br>— English — Upper- Intermediate/Advanced <br><br><b>The Nice to Haves </b> <br>— Experience with blockchain technologies <br>— Experience working on Agile / Scrum teams<br>— Experience with Smart Contracts and Crypto Wallets <br>— Knowledge of scripting languages: Rust, JS<br>— Experience with Clickhouse, Redis, Rabbit<br>— Knowledge of GRPC technology<br><br><b>The Perks</b> <br>— Competitive salary and bonuses<br>— Health and wellness benefits package: medical assistance, gym membership reimbursement, free mental health assistance<br>— Flexible working hours and an opportunity to work remotely<br>— Interesting, responsible, and challenging job in the crypto market<br>— Crypto investment opportunity and advisory assistance<br>— Free English courses with daily practice<br>— Professional development assistance<br>— Paid vacation, holidays, and sick leaves<br>— Relocation package if desired<br>— Adequate management with minimal bureaucracy<br>— Dynamic agile working environment and a team of good professionals</p><h3>Про компанію Everstake</h3><p>Everstake is the biggest staking provider in the blockchain industry, trusted by 735k users. We use enterprise-level hardware to run nodes for the most popular blockchain networks since 2018. Everstake also creates complex blockchain products, such as lending protocols, staking pools, blockchain bridges, and marketplaces. <br><br>In cooperation with the Ministry of Digital Transformation of Ukraine, we launched an initiative called “Aid For Ukraine” that raises funds from the crypto community for the benefit of Ukraine’s military and humanitarian needs.<br>We have been developing smart contracts and building complex blockchain products.<br>We speak Rust, GO, Solidity, and other languages <br><br>According to our team survey, Everstake’s employees enjoy using the latest tech stack, working remotely in a positive environment, and having an opportunity to take initiative. <br><br>Given the current economic and political situation in the world, blockchain expertise is the most in-demand skill. It’s also the fastest-growing skill. Come join us if you’re looking for the right place to start your crypto journey.<br><br><strong>Сайт компанії:</strong> <br><a href=\"https://everstake.one/\" target=\"_blank\">everstake.one</a></p>\n\n\n\n\n\n<div>\n    <a href=\"https://jobs.dou.ua/companies/everstake-company/vacancies/264447/#reply-btn-id\">Відгукнутись на вакансію</a>\n</div>",
        "pub_date": "Fri, 31 May 2024 13:51:17 +0300",
        "guid": "https://jobs.dou.ua/companies/everstake-company/vacancies/264447/?1717152677"
    }
]